package 面试经历;

/**
 *
 * 美团点评 2019春招 后台开发方向在线考试
 * 编程题 | 30.0分1/2
 * 修改矩阵
 * 时间限制：C/C++语言 1000MS；其他语言 3000MS
 * 内存限制：C/C++语言 65536KB；其他语言 589824KB
 * 题目描述：
 * 我们称一个矩阵为黑白矩阵，当且仅当对于该矩阵中每一个位置如(i,j),其上下左右四个方向的数字相等，
 * 即(i-1,j),(i+1,j),(i,j+1),(i,j-1)四个位置上的数字两两相等且均不等于(i,j)位置上的数字。(超出边界的格子忽略)
 *
 * 现在给出一个n*m的矩阵，我们想通过修改其中的某些数字，使得该矩阵成为黑白矩阵，问最少修改多少个数字。
 *
 * 输入
 * 第一行包含两个整数n,m,表示矩阵的长宽。(1≤n,m≤100000,1≤n*m≤100000)。
 *
 * 接下来有n行，每行包含m个整数，中间用空格隔开，表示n*m的矩阵。
 *
 * 输出
 * 输出仅包含一个数字，表示该矩阵想修改为黑白矩阵最少修改的数字数量。
 *
 *
 * 样例输入
 * 3 3
 * 1 1 1
 * 1 1 1
 * 1 1 1
 * 样例输出
 * 4
 *
 * 提示
 * 补充样例
 * 输入样例2
 * 3 3
 * 1 1 1
 * 1 5 1
 * 1 1 1
 * 输出样例2
 * 4
 * 规则
 * 请尽量在全场考试结束10分钟前调试程序，否则由于密集排队提交，可能查询不到编译结果
 * 点击“调试”亦可保存代码
 * 编程题可以使用本地编译器，此页面不记录跳出次数
 */
public class 修改矩阵 {




}
